---
kind: type
id: T:Autodesk.Revit.DB.PlanViewRange
source: html/7edc5f13-a5fa-5c7a-9a03-ac6cbed1f005.htm
---
# Autodesk.Revit.DB.PlanViewRange

This class represents the view range of a plan view or a plan region.
 It records the element ids of the levels which a plane is relative to
 and the offset of each plane from that level.

## Syntax (C#)
```csharp
public class PlanViewRange : IDisposable
```